_Rarzrabotki/Rarus/USO2/Enums/СМ_ВидыРасценки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ВидыРасценки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Транспортировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МебельИнвентарь</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_МетодыРасчетаЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_МетодыРасчетаЛС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БазисноИндексный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ресурсный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/СМ_ОбъектнаяСмета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>СМ_ОбъектнаяСмета</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазисныеЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлаваССРС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ГлавыССРС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_ОбъектнаяСмета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДРодителя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_СводнаяСмета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инвестор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодикаРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_МетодикиРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСметы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подрядчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроводитьОкругление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоставленаВЦенахНа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_СтатусыСметныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стройка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСтроительства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ТипыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматОкругления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЛокальныеСметы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛокальнаяСмета</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СМ_ЛокальнаяСмета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоОбъектов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расчет</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЛимитированныеЗатраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛимитированнаяЗатрата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СМ_ЛимитированныеЗатраты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеЛимЗатраты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормулаЛимЗатраты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазисноеЗначениеЛимЗатраты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормулаБазисногоЗначениеЛимЗатраты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентСметнойЗарплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентТрудоемкости</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расчет</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подписи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыводитьВШапку</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/CommonForms/СМ_ФормаВыбораПрайсов/Ext/Form/Module.bsl
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПриОткрытииНаСервере();
	ТаблицаПрайсов.Очистить();
	Для Каждого СтрокаТекущая Из СписокСмет.ПолучитьЭлементы() Цикл
		ПодчинЭлем = СтрокаТекущая.ПолучитьЭлементы();
		Для каждого ТекПодчинЭлем  Из  ПодчинЭлем Цикл
			Если ТекПодчинЭлем.Отметка = Истина Тогда
				СсылкаСметы = ТекПодчинЭлем.Ссылка;
				Прервать;
			КонецЕсли;	
		КонецЦикла;		
		Если СтрокаТекущая.Отметка = Истина Тогда
			СсылкаСметы = СтрокаТекущая.Ссылка;
			Прервать;
		КонецЕсли;	
	КонецЦикла;	
	Если СсылкаСметы <> Неопределено Тогда
			СписокПозиций = ВыбратьПозицииПрайсы(СсылкаСметы);
			Если СписокПозиций.Количество() <> 0 Тогда
				ЗаполнитьПоляТаблПрайсов(СписокПозиций);
			КонецЕсли;
			
		КонецЕсли;

	КонецПроцедуры
	
&НаКлиенте
Процедура ЗаполнитьПоляТаблПрайсов(СписокПозиций)
	Для Каждого СтрокаПозиции Из СписокПозиций Цикл
		НоваяСтрока = ТаблицаПрайсов.Добавить();
		ТекПозиция =  СтрокаПозиции;
		СтруктураПараметров = Новый Структура("ШифрРасценки, Наименование, ТекущаяЦена,Измеритель,ЕдиницаИзмерения,БазиснаяЦена,Определитель,ФлОборудование");
		НоваяСтрока.Позиция =  ТекПозиция ;
		ПолучитьПараметрыПозиции(ТекПозиция, СтруктураПараметров);
		НоваяСтрока.ШифрРасценки = СтруктураПараметров.ШифрРасценки;
		НоваяСтрока.Наименование = СтруктураПараметров.Наименование;
		НоваяСтрока.Измеритель = СтруктураПараметров.Измеритель;
		НоваяСтрока.ЕдиницаИзмерения = СтруктураПараметров.ЕдиницаИзмерения;
		НоваяСтрока.ТекущаяЦена  = СтруктураПараметров.ТекущаяЦена;
		НоваяСтрока.БазиснаяЦена = СтруктураПараметров.БазиснаяЦена;
		НоваяСтрока.Определитель = СтруктураПараметров.Определитель;
		НоваяСтрока.ФлОборудование = СтруктураПараметров.ФлОборудование;
		НоваяСтрока.НормаРасхода = НормаРасхода;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура НайтиПоНаимен(Команда)
	СтрокаПоиска = СокрЛП(СтрокаПоиска);
	Если СтрДлина(СтрокаПоиска) = 0 Тогда
		Возврат;
	КонецЕсли;	
	
	Для Каждого СтрокаТабл Из ТаблицаПрайсов Цикл
		Если Найти(ВРег(СтрокаТабл.Наименование),ВРег(СтрокаПоиска)) <> 0 Тогда
			СтрокаТабл.Отметка = Истина;
		Иначе
			СтрокаТабл.Отметка = Ложь;
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)
	Список = ПолучитьПараметрыЗакрытияФормы();	
	ЭтаФорма.Закрыть(Список);
КонецПроцедуры

&НаКлиенте
Процедура СписокСметПриИзменении(Элемент)
	ТаблицаПрайсов.Очистить();
	
	Если Элемент.ТекущиеДанные.Отметка = Истина Тогда
		СохраненнаяСтрока = Элемент.ТекущиеДанные.Ссылка;
		СтрокаДерева = Неопределено;
		ТекущиеДанные = Элементы.СписокСмет.ТекущиеДанные;
		
		СМ_СметныйСоставКлиент.СохранитьТекущийЭлемент(СтрокаДерева, ТекущиеДанные, Элементы.СписокСмет, СписокСмет.ПолучитьЭлементы(),"Ссылка");
		
		УбратьОтметки(СохраненнаяСтрока);
		
		СМ_СметныйСоставКлиент.ВосстановитьТекущийЭлемент(Элементы.СписокСмет, СписокСмет.ПолучитьЭлементы(), СписокСмет, СтрокаДерева,"Ссылка");
		
		СписокПозиций = ВыбратьПозицииПрайсы(СохраненнаяСтрока);
		Если СписокПозиций.Количество() <> 0 Тогда
			ЗаполнитьПоляТаблПрайсов(СписокПозиций);
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЛокСмета = Параметры.ЛокСмета;
	НормаРасхода = Параметры.НормаРасхода;
	Прайсы = Параметры.Прайсы;
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыЗакрытияФормы()
	
	Для Каждого СтрокаПрайса Из ТаблицаПрайсов Цикл
		Если СтрокаПрайса.Отметка = Истина Тогда
			Запись = Новый Структура;
			Запись.Вставить("Прайс", СтрокаПрайса.Позиция);
			Запись.Вставить("ШифрРасценки", СтрокаПрайса.ШифрРасценки);
			Запись.Вставить("Наименование", СтрокаПрайса.Наименование);
			Запись.Вставить("Измеритель", СтрокаПрайса.Измеритель);
			Запись.Вставить("ЕдиницаИзмерения", СтрокаПрайса.ЕдиницаИзмерения);
			Запись.Вставить("БазиснаяЦена", СтрокаПрайса.БазиснаяЦена);
			Запись.Вставить("ТекущаяЦена",  СтрокаПрайса.ТекущаяЦена);
			Запись.Вставить("Определитель", СтрокаПрайса.Определитель);
			Запись.Вставить("ФлОборудование", СтрокаПрайса.ФлОборудование);
			Запись.Вставить("НормаРасхода", СтрокаПрайса.НормаРасхода);
			Запись.Вставить("ПереноситьПоправки", ПереноситьПоправки);
			Запись.Вставить("ПереноситьЧП", ПереноситьЧП);
			Запись.Вставить("ПереноситьПримечания", ПереноситьПримечания);
			Запись.Вставить("НормСборник", СтрокаПрайса.Позиция.ТипНормативныхСборников);
			
			Прайсы.Добавить(Запись);
		КонецЕсли;	
	КонецЦикла;	
	Возврат(Прайсы);	
КонецФункции

&НаСервере
Процедура ПриОткрытииНаСервере()
	ОтмеченнаяСтрока = Неопределено;
	ТабРезультат = ВыбратьСметы();
	ДеревоЗначений = РеквизитФормыВЗначение("СписокСмет", Тип("ДеревоЗначений"));
	ДеревоЗначений.Строки.Очистить();
	ИндексСтроки = 0;
	Для Каждого ТекСтрока Из ТабРезультат Цикл
		Если ЗначениеЗаполнено(ТекСтрока.ИДРодителя) Тогда
			НайденнаяСтрока = ДеревоЗначений.Строки.Найти(ТекСтрока.ИДРодителя,"Ссылка",Истина);	
			Если НайденнаяСтрока <> Неопределено Тогда
				СтрокаДерева = НайденнаяСтрока.Строки.Добавить();	
			Иначе
				СтрокаДерева = ДеревоЗначений.Строки.Добавить();	
			КонецЕсли;			
		Иначе
			СтрокаДерева = ДеревоЗначений.Строки.Добавить();	
		КонецЕсли;	
		ЗаполнитьЗначенияСвойств(СтрокаДерева,ТекСтрока);
		Если СтрокаДерева.Ссылка = ЛокСмета Тогда
			СтрокаДерева.Отметка = Истина;
		Иначе
			СтрокаДерева.Отметка = Ложь;
		КонецЕсли;
		СтрокаДерева.Картинка 	 = ПолучитьКартинкуСтроки(СтрокаДерева.Ссылка);
	КонецЦикла;
	ЗначениеВРеквизитФормы(ДеревоЗначений,"СписокСмет");
		
КонецПроцедуры

&НаСервере
Функция ВыбратьПозицииПрайсы(Ссылка)
	МассивПозиций = Новый Массив();
	Если Ссылка <> Неопределено Тогда
		Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета") Тогда
		
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	СМ_ПозицияЛокальнойСметы.Ссылка КАК Позиция
			|ИЗ
			|	Документ.СМ_ПозицияЛокальнойСметы КАК СМ_ПозицияЛокальнойСметы
			|ГДЕ
			|	СМ_ПозицияЛокальнойСметы.ИДСметы = &ИДСметы
			|	И СМ_ПозицияЛокальнойСметы.ПометкаУдаления = ЛОЖЬ
			|   И (СМ_ПозицияЛокальнойСметы.Определитель.ВидРасценки = &Оборудование
			|	ИЛИ СМ_ПозицияЛокальнойСметы.Определитель.ВидРасценки = &Материал) " ;
			Запрос.УстановитьПараметр("ИДСметы",Ссылка);
		Запрос.УстановитьПараметр("Материал",Перечисления.СМ_ВидыРасценки.Материал);
		Запрос.УстановитьПараметр("Оборудование",Перечисления.СМ_ВидыРасценки.Оборудование);

		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.СМ_ОбъектнаяСмета") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	СМ_ПозицияЛокальнойСметы.Ссылка КАК Позиция
		|ИЗ
		|	Документ.СМ_ПозицияЛокальнойСметы КАК СМ_ПозицияЛокальнойСметы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СМ_ОбъектнаяСмета.ЛокальныеСметы КАК СМ_ОбъектнаяСметаЛокальныеСметы
		|		ПО СМ_ПозицияЛокальнойСметы.ИДСметы = СМ_ОбъектнаяСметаЛокальныеСметы.ЛокальнаяСмета
		|ГДЕ
		|	СМ_ОбъектнаяСметаЛокальныеСметы.Расчет = ИСТИНА
		|	И СМ_ОбъектнаяСметаЛокальныеСметы.Ссылка = &Ссылка
		|	И СМ_ПозицияЛокальнойСметы.ПометкаУдаления = ЛОЖЬ
		|	И СМ_ОбъектнаяСметаЛокальныеСметы.ЛокальнаяСмета.ПометкаУдаления = ЛОЖЬ
		|   И (СМ_ПозицияЛокальнойСметы.Определитель.ВидРасценки = &Оборудование
		|	ИЛИ СМ_ПозицияЛокальнойСметы.Определитель.ВидРасценки = &Материал) " ;
		
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
		Запрос.УстановитьПараметр("Материал",Перечисления.СМ_ВидыРасценки.Материал);
		Запрос.УстановитьПараметр("Оборудование",Перечисления.СМ_ВидыРасценки.Оборудование);
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.СМ_СводнаяСмета") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =  "ВЫБРАТЬ
		                |	СМ_ПозицияЛокальнойСметы.Ссылка КАК Позиция
						|ИЗ
						|	Документ.СМ_СводнаяСмета.Сметы КАК СМ_СводнаяСметаСметы
						|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СМ_ОбъектнаяСмета.ЛокальныеСметы КАК СМ_ОбъектнаяСметаЛокальныеСметы
						|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СМ_ПозицияЛокальнойСметы КАК СМ_ПозицияЛокальнойСметы
						|			ПО СМ_ОбъектнаяСметаЛокальныеСметы.ЛокальнаяСмета = СМ_ПозицияЛокальнойСметы.ИДСметы
						|		ПО СМ_СводнаяСметаСметы.Смета = СМ_ОбъектнаяСметаЛокальныеСметы.Ссылка
						|ГДЕ
						|	СМ_СводнаяСметаСметы.Ссылка = &Ссылка
						|	И СМ_ОбъектнаяСметаЛокальныеСметы.Расчет = ИСТИНА
						|	И СМ_ПозицияЛокальнойСметы.ПометкаУдаления = ЛОЖЬ
						|	И СМ_ОбъектнаяСметаЛокальныеСметы.ЛокальнаяСмета.ПометкаУдаления = ЛОЖЬ
						|	И СМ_ОбъектнаяСметаЛокальныеСметы.Ссылка.ПометкаУдаления = ЛОЖЬ
						|   И (СМ_ПозицияЛокальнойСметы.Определитель.ВидРасценки = &Оборудование
						|	ИЛИ СМ_ПозицияЛокальнойСметы.Определитель.ВидРасценки = &Материал) 
						
						|
						|ОБЪЕДИНИТЬ ВСЕ
		                |
		                |ВЫБРАТЬ
		                |	СМ_ПозицияЛокальнойСметы.Ссылка
		                |ИЗ
		                |	Документ.СМ_СводнаяСмета.Сметы КАК СМ_СводнаяСметаСметы
		                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СМ_ПозицияЛокальнойСметы КАК СМ_ПозицияЛокальнойСметы
		                |		ПО СМ_СводнаяСметаСметы.Смета = СМ_ПозицияЛокальнойСметы.ИДСметы
		                |ГДЕ
		                |	СМ_СводнаяСметаСметы.Ссылка = &Ссылка
		                |	И СМ_ПозицияЛокальнойСметы.ПометкаУдаления = ЛОЖЬ
		                |	И СМ_СводнаяСметаСметы.Смета.ПометкаУдаления = ЛОЖЬ";
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		Запрос.УстановитьПараметр("Материал",Перечисления.СМ_ВидыРасценки.Материал);
		Запрос.УстановитьПараметр("Оборудование",Перечисления.СМ_ВидыРасценки.Оборудование);
	КонецЕсли;	
	
	
	Результат = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Позиция.РегиональнаяБаза.Пустая() Тогда
			МассивПозиций.Добавить(ВыборкаДетальныеЗаписи.Позиция);
		КонецЕсли;
	КонецЦикла;	
КонецЕсли;
Возврат(МассивПозиций);
КонецФункции

&НаСервере
Функция ВыбратьСметы()
Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛокальнаяСмета.Ссылка,
	               |	ЛокальнаяСмета.ИД КАК ИД,
	               |	ЛокальнаяСмета.ИДРодителя КАК ИДРодителя,
	               |	ЛокальнаяСмета.Наименование,
	               |	ЛокальнаяСмета.НомерСметы,
				   |	""ЛокальнаяСмета"" КАК Тип
	               |ПОМЕСТИТЬ ТаблицаВсехСмет
	               |ИЗ
	               |	Документ.СМ_ЛокальнаяСмета КАК ЛокальнаяСмета 
				   |ГДЕ ЛокальнаяСмета.ПометкаУдаления = ЛОЖЬ ";
					Запрос.Текст = Запрос.Текст + "
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СМ_ОбъектнаяСмета.Ссылка,
	               |	СМ_ОбъектнаяСмета.ИД,
	               |	СМ_ОбъектнаяСмета.ИДРодителя,
	               |	СМ_ОбъектнаяСмета.Наименование,
	               |	СМ_ОбъектнаяСмета.НомерСметы,
				   |	""ОбъектнаяСмета""
	               |ИЗ
	               |	Документ.СМ_ОбъектнаяСмета КАК СМ_ОбъектнаяСмета  
				   |ГДЕ СМ_ОбъектнаяСмета.ПометкаУдаления = ЛОЖЬ ";
				Запрос.Текст = Запрос.Текст + "
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СМ_СводнаяСмета.Ссылка,
	               |	СМ_СводнаяСмета.ИД,
	               |	0,
	               |	СМ_СводнаяСмета.Наименование,
	               |	СМ_СводнаяСмета.НомерСметы,
				   |	""СводнаяСмета""
	               |ИЗ
	               |	Документ.СМ_СводнаяСмета КАК СМ_СводнаяСмета 	               
				   |ГДЕ СМ_СводнаяСмета.ПометкаУдаления = ЛОЖЬ ";
					Запрос.Текст = Запрос.Текст + "
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаВсехСмет.Ссылка,
	               |	ТаблицаВсехСмет.ИД,
	               |	ТаблицаВсехСмет.ИДРодителя,
	               |	ТаблицаВсехСмет.Наименование,
				   |	ТаблицаВсехСмет.Тип,
	               |	ТаблицаВсехСмет.НомерСметы КАК НомерСметы
	               |ИЗ
	               |	ТаблицаВсехСмет КАК ТаблицаВсехСмет
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСметы";
				   
	 ТабРезультат = Запрос.Выполнить().Выгрузить();
	
	Возврат ТабРезультат;
КонецФункции

&НаСервере
Функция ПолучитьКартинкуСтроки(ТекЭлемент)
	
	// 0. Лим затрата
	// 1. СС
	// 2. ОС
	// 3. ЛС (ресурсный метод)
	// 4. ЛС (базисно инд метод)
	// 5. ЛС просто	
	
	//  с пометкой удаления
	// 7. СС
	// 8. ОС
	// 9. ЛС (ресурсный метод)
	// 10. ЛС (базисно инд метод)
	// 11. ЛС просто	
		
	Если ТипЗнч(ТекЭлемент) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета") Тогда
		Если ТекЭлемент.МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.Ресурсный Тогда
			ТекКартинка = ?(ТекЭлемент.ПометкаУдаления,9,?(ТекЭлемент.Проведен,15,3));
			Возврат ТекКартинка;	
		ИначеЕсли ТекЭлемент.МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.БазисноИндексный Тогда
			ТекКартинка = ?(ТекЭлемент.ПометкаУдаления,10,?(ТекЭлемент.Проведен,16,4));
			Возврат ТекКартинка;
		Иначе
			ТекКартинка = ?(ТекЭлемент.ПометкаУдаления,11,?(ТекЭлемент.Проведен,17,5));
			Возврат ТекКартинка;
		КонецЕсли;	
	ИначеЕсли ТипЗнч(ТекЭлемент) = Тип("ДокументСсылка.СМ_ОбъектнаяСмета") Тогда
		ТекКартинка = ?(ТекЭлемент.ПометкаУдаления,8,?(ТекЭлемент.Проведен,14,2));
		Возврат ТекКартинка;
	ИначеЕсли ТипЗнч(ТекЭлемент) = Тип("ДокументСсылка.СМ_СводнаяСмета") Тогда
		ТекКартинка = ?(ТекЭлемент.ПометкаУдаления,7,?(ТекЭлемент.Проведен,13,1));
		Возврат ТекКартинка;
	Иначе
		Возврат	5;
	КонецЕсли;	
		
КонецФункции

&НаСервере
Процедура ПолучитьПараметрыПозиции(СсылкаНаДокумент, СтруктураПараметров)
	СтруктураПараметров.Вставить("ШифрРасценки", СсылкаНаДокумент.ШифрРасценки);
	СтруктураПараметров.Вставить("Наименование", СсылкаНаДокумент.Наименование);
	СтруктураПараметров.Вставить("ТекущаяЦена", СсылкаНаДокумент.ТекущаяЦена);
	СтруктураПараметров.Вставить("Измеритель", СсылкаНаДокумент.Измеритель);
	СтруктураПараметров.Вставить("ЕдиницаИзмерения", СсылкаНаДокумент.ЕдиницаИзмерения);
	СтруктураПараметров.Вставить("БазиснаяЦена", СсылкаНаДокумент.ПрямЗатраты + СсылкаНаДокумент.Оборудование);
	ВидПрайса = СсылкаНаДокумент.Определитель.ВидРасценки;
	СтруктураПараметров.Вставить("Определитель", СсылкаНаДокумент.Определитель);
	СтруктураПараметров.Вставить("ФлОборудование", ?(ВидПрайса = Перечисления.СМ_ВидыРасценки.Оборудование,Истина,Ложь));
	
КонецПроцедуры

&НаСервере
Процедура УбратьОтметки(ТекущаяСсылка)
	ДеревоЗначений = РеквизитФормыВЗначение("СписокСмет", Тип("ДеревоЗначений"));
	Строки = ДеревоЗначений.Строки;
	Для Каждого Строка Из Строки Цикл
		ПодчиненныеСтроки =  Строка.Строки;
		Для каждого ПодчинСтрока Из ПодчиненныеСтроки Цикл
			ПодчиненныеСтроки2 =  ПодчинСтрока.Строки;
			Для каждого ПодчинСтрока2 Из ПодчиненныеСтроки2 Цикл
				Если ПодчинСтрока2.Ссылка <>  ТекущаяСсылка Тогда
					ПодчинСтрока2.Отметка = Ложь;
				КонецЕсли;
			КонецЦикла;
			Если ПодчинСтрока.Ссылка <>  ТекущаяСсылка Тогда
				ПодчинСтрока.Отметка = Ложь;
			КонецЕсли;
		КонецЦикла;
		Если Строка.Ссылка <>  ТекущаяСсылка Тогда
			Строка.Отметка = Ложь;
		КонецЕсли;
	КонецЦикла;
	ЗначениеВРеквизитФормы(ДеревоЗначений,"СписокСмет");

КонецПроцедуры

#КонецОбласти
